In [1]:
import pandas as pd

In [5]:
gfti = pd.read_csv("gfti_placement.csv")
nit = pd.read_csv("NITs_Placement_Data.csv")
iiit = pd.read_csv("IIITs_Colleges_Placements.csv")

In [6]:
gfti.head()

,Institute Name,Location,Average Package (INR),Highest Package (INR)
0,Assam University,Silchar,Not Available,Not Available
1,BIT Mesra,Ranchi,INR 6.5 LPA,INR 51 LPA
2,Gurukula Kangri Vishwavidyalaya,Haridwar,INR 4 LPA,INR 10 LPA
3,IIEST Shibpur,West Bengal,INR 9 LPA,INR 46.5 LPA
4,Institute of Infrastructure Technology Researc...,Ahmedabad,INR 6 LPA,INR 13 LPA

In [7]:
nit.head()

,Name of NITs,Average Domestic Package (LPA),Highest Domestic Package (LPA)
0,Dr B R Ambedkar National Institute of Technolo...,7.53,31.12
1,"Malaviya National Institute of Technology, Jaipur",7.5,37.00
2,"Maulana Azad National Institute of Technology,...",7.84,34.00
3,Motilal Nehru National Institute of Technology...,7.82,36.00
4,"National Institute of Technology, Mizoram",6.62,17.30

In [8]:
iiit.head()

,College,Average Package,Highest Package
Indian Institute of Information Technology,Allahabad,2578000,12100000
Indian Institute of Information Technology,Lucknow,3371000,14500000
Atal Bihari Vajpayee Indian Institute of Information Technology and Management,Gwalior,2056000,6500000
Indian Institute of Information Technology Design and Manufacturing,Jabalpur,1927000,11000000
Indian Institute of Information Technology,Pune,1360000,4300000

In [15]:
iiit["College"].head(2)

Indian Institute of Information Technology    Allahabad
Indian Institute of Information Technology      Lucknow
Name: College, dtype: object

In [ ]:
iiit["College"] = iiit["College"].str.replace(r'\s+', ' ', regex=True).str.strip()

In [16]:
nit.head()

,Name of NITs,Average Domestic Package (LPA),Highest Domestic Package (LPA)
0,Dr B R Ambedkar National Institute of Technolo...,7.53,31.12
1,"Malaviya National Institute of Technology, Jaipur",7.5,37.00
2,"Maulana Azad National Institute of Technology,...",7.84,34.00
3,Motilal Nehru National Institute of Technology...,7.82,36.00
4,"National Institute of Technology, Mizoram",6.62,17.30

In [5]:
import pandas as pd

nit = pd.read_csv("nit_with_placement.csv")
iiit = pd.read_csv("iiit_with_placements.csv")

In [10]:
nit = nit.drop(columns=["institute_normalized","institute_y"])

In [15]:
nit = nit.rename(columns={"institute_x":"institute"})

In [16]:
nit.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,college_id,average_package,highest_package
0,Dr. B R Ambedkar National Institute of Technol...,OPEN,Gender-Neutral,58313.0,65917.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
1,Dr. B R Ambedkar National Institute of Technol...,OPEN,Female-only (including Supernumerary),53084.0,53648.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
2,Dr. B R Ambedkar National Institute of Technol...,EWS,Gender-Neutral,10180.0,10180.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
3,Dr. B R Ambedkar National Institute of Technol...,EWS,Female-only (including Supernumerary),16293.0,16293.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
4,Dr. B R Ambedkar National Institute of Technol...,OBC-NCL,Gender-Neutral,33291.0,52241.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12

In [7]:
iiit.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,college_id,average_package,highest_package
0,Atal Bihari Vajpayee Indian Institute of Infor...,OPEN,Gender-Neutral,5514,7835,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN,2056000.0,6500000.0
1,Atal Bihari Vajpayee Indian Institute of Infor...,OPEN,Female-only (including Supernumerary),9323,14651,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN,2056000.0,6500000.0
2,Atal Bihari Vajpayee Indian Institute of Infor...,OPEN (PwD),Gender-Neutral,129,129,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN,2056000.0,6500000.0
3,Atal Bihari Vajpayee Indian Institute of Infor...,OPEN (PwD),Female-only (including Supernumerary),481,481,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN,2056000.0,6500000.0
4,Atal Bihari Vajpayee Indian Institute of Infor...,EWS,Gender-Neutral,1014,1053,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN,2056000.0,6500000.0

In [17]:
nit.to_csv('NITs_Placement_Data.csv', index=False)

In [18]:
iiit.to_csv('iiit_Placement_Data.csv', index=False)

In [19]:
jee_mainss = pd.concat([nit,iiit], ignore_index = True)

In [26]:
jee_mains = jee_mainss.rename(columns={"college_id":"nirf_rank"})

In [28]:
jee_mains.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,nirf_rank,average_package,highest_package
0,Dr. B R Ambedkar National Institute of Technol...,OPEN,Gender-Neutral,58313.0,65917.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
1,Dr. B R Ambedkar National Institute of Technol...,OPEN,Female-only (including Supernumerary),53084.0,53648.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
2,Dr. B R Ambedkar National Institute of Technol...,EWS,Gender-Neutral,10180.0,10180.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
3,Dr. B R Ambedkar National Institute of Technol...,EWS,Female-only (including Supernumerary),16293.0,16293.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
4,Dr. B R Ambedkar National Institute of Technol...,OBC-NCL,Gender-Neutral,33291.0,52241.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12

In [44]:
jee_mains.to_csv('jee_mains.csv', index=False)

In [43]:
jee_mains.isna().sum()

institute              0
seat_type              0
gender                 0
opening_rank           0
closing_rank           0
round_number           0
program_name           0
duration               0
degree_raw             0
nirf_rank          26645
average_package        0
highest_package        0
dtype: int64

In [42]:
jee_mains[jee_mains["average_package"].isna()]["institute"].unique()

array([], dtype=object)

In [33]:
import pandas as pd

# Placement data (from the web search)
placement_data = {
    'institute': [
        'National Institute of Technology Agartala',
        'National Institute of Technology Hamirpur',
        'National Institute of Technology Karnataka, Surathkal',
        'National Institute of Technology Arunachal Pradesh',
        'National Institute of Technology, Jamshedpur',
        'National Institute of Technology, Srinagar',
        'National Institute of Technology, Tiruchirappalli',
        'National Institute of Technology, Uttarakhand',
        'Indian Institute of Engineering Science and Technology, Shibpur',
        'Indian Institute of Information Technology, Design & Manufacturing, Kancheepuram'
    ],
    'average_package': [
        5.0,    # NIT Agartala
        10.58,  # NIT Hamirpur
        16.25,  # NIT Surathkal (NITK)
        7.5,    # NIT Arunachal (median for MTech)
        12.63,  # NIT Jamshedpur
        13.8,   # NIT Srinagar
        27.2,   # NIT Trichy (CSE)
        8.03,   # NIT Uttarakhand
        None,   # IIEST Shibpur (data not available)
        None    # IIITDM Kancheepuram (data not available)
    ],
    'highest_package': [
        41,     # NIT Agartala
        205,    # NIT Hamirpur
        55,     # NIT Surathkal
        59,     # NIT Arunachal
        82,     # NIT Jamshedpur
        39,     # NIT Srinagar
        52.9,   # NIT Trichy
        12.5,   # NIT Uttarakhand
        None,   # IIEST Shibpur
        None    # IIITDM Kancheepuram
    ]
}

# Convert to DataFrame
placement_df = pd.DataFrame(placement_data)

In [34]:
# Update only where values are missing
jee_mains.update(
    jee_mains.merge(
        placement_df,
        on='institute',
        how='left',
        suffixes=('', '_new')
    ).assign(
        average_package=lambda df: df['average_package'].combine_first(df['average_package_new']),
        highest_package=lambda df: df['highest_package'].combine_first(df['highest_package_new'])
    )[["average_package", "highest_package"]]
)

In [35]:
jee_mains.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,nirf_rank,average_package,highest_package
0,Dr. B R Ambedkar National Institute of Technol...,OPEN,Gender-Neutral,58313.0,65917.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
1,Dr. B R Ambedkar National Institute of Technol...,OPEN,Female-only (including Supernumerary),53084.0,53648.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
2,Dr. B R Ambedkar National Institute of Technol...,EWS,Gender-Neutral,10180.0,10180.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
3,Dr. B R Ambedkar National Institute of Technol...,EWS,Female-only (including Supernumerary),16293.0,16293.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12
4,Dr. B R Ambedkar National Institute of Technol...,OBC-NCL,Gender-Neutral,33291.0,52241.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,7.53,31.12

In [41]:
import pandas as pd

placement_data = {
    'institute': [
        'National Institute of Technology, Andhra Pradesh',
    ],
    'average_package': [
        8.13,   # NIT Andhra Pradesh
        ],
    'highest_package': [
        44.1,   # NIT Andhra Pradesh
       
    ]
}

placement_df = pd.DataFrame(placement_data)

jee_updated = jee_mains.merge(
    placement_df,
    on='institute',
    how='left',
    suffixes=('', '_new')
).assign(
    average_package=lambda df: df['average_package'].combine_first(df['average_package_new']),
    highest_package=lambda df: df['highest_package'].combine_first(df['highest_package_new'])
)

# If you want to update in place:
jee_mains[['average_package', 'highest_package']] = jee_updated[['average_package', 'highest_package']]